app/controllers/blacks_controller.rb

SELECT * FROM "blacks"
---
  def index
    @blacks = Black.all

SELECT * FROM "blacks" WHERE ("blacks"."id" = 1)
---
  def show
    @black = Black.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
INSERT INTO "blacks" ("boxofshit_file_size", "boxofshit_updated_at", "created_at", "updated_at", "userid", "lastaccessed", "boxofshit_content_type", "description", "boxofshit_file_name") VALUES(80215, '2010-02-20 02:10:34', '2010-02-20 02:10:34', '2010-02-20 02:10:34', NULL, NULL, 'image/jpeg', 'yo yo yo', 'Photo_on_2010-02-13_at_23.18.jpg')
---
  def create

    if logged_in?
      @user = current_user

    else
      @user = User.find(2)
    end

    @black = Black.new(params[:black])

    @black.user_id = @user.id




    if @black.save

SELECT * FROM "blacks" WHERE ("blacks"."id" = 3)
---
  def edit
    @black = Black.find(params[:id])

SELECT * FROM "blacks" WHERE ("blacks"."id" = 3)
UPDATE "blacks" SET "updated_at" = '2010-02-19 01:10:51', "ownerid" = 0, "description" = 'you fag fuckyyyyy' WHERE "id" = 3
---
  def update
    @black = Black.find(params[:id])
    if @black.update_attributes(params[:black])

SELECT * FROM "blacks" WHERE ("blacks"."id" = 1)
DELETE FROM "blacks" WHERE "id" = 1
---
  def destroy
    @black = Black.find(params[:id])
    @black.destroy