app/controllers/blogs_controller.rb

SELECT * FROM "blogs"
---
  def index
    @blogs = Blog.all

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
---
  def show
    @blog = Blog.find(params[:id])

INSERT INTO "blogs" ("created_at", "title", "body", "updated_at") VALUES('2010-02-19 04:20:49', 'Shoowwwig', 'your a little lady', '2010-02-19 04:20:49')
---
  def create
    @blog = Blog.new(params[:blog])
    if @blog.save