app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "email", "created_at") VALUES('2010-02-17 02:59:55', 'ef5fd9ba6ec1d96ba5825bc22d2c468c12608be53079ff0dd09b75447c7c27b895e81e7629439cd1fd8e8ad41f5b6142a1e1859f27485275f1a7160e5575daa9', 'darren.holland', 'u14a4DHYk7fQLGkG7OdP', '7550b809bdeef455257a76043d63a68ec7c0c1ca455e645c4aad13f78eb3e7badcc135f2b84cb3142a524f0c8727401d5b3ab302eb786f6c3b595644d391c720', 'test@email.com', '2010-02-17 02:59:55')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 0)
---
  def edit
    @user = User.find(params[:id])